_protected/controllers/MenuController.php

SELECT * FROM `tree_menu` WHERE `status`=1
---
    public function actionGetData(){
        $treeMenu = new TreeMenu();

        $data = $treeMenu->find()
            ->Where(['status' => $treeMenu::STATUS_NEW])
            ->all();

INSERT INTO `tree_menu` (`parent`, `name`, `status`, `created_at`, `updated_at`, `created_by`, `updated_by`) VALUES (1, '1', 1, 1501759218, 1501759218, 1, 1)
---
    public function actionUpdate(){
        $treeMenu = new TreeMenu();

        if(\Yii::$app->user->identity->superadmin){
            $treeMenu->parent = $_POST['parent'];
            $treeMenu->name = $_POST['name'];
            $treeMenu->status = $treeMenu::STATUS_NEW;
            if($treeMenu->save()){