_protected/models/User.php

SELECT * FROM `user` WHERE (`email_confirm_token`='N18E8T8t3m-46dzSRG8Hx-48xWy5B7qy') AND (`status`=2)
---
    public static function findByEmailConfirmToken($email_confirm_token)
    {
        return static::findOne(['email_confirm_token' => $email_confirm_token, 'status' => self::STATUS_WAIT, 'email_confirmed'=> self::STATUS_WAIT]);